DataProcessors/ЖурналЗаписиСтационар.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ЖурналЗаписиСтационар</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыДвиженияВСтационаре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДвиженияВСтационаре</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеУсловий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводМеждуПодразделениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выписка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/БронированиеКойкоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>БронированиеКойкоМеста</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостояниеКойкоМеста</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УстановкаУсловийПребывания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаУсловийПребывания</Name>
			<Comment>Установка условий пребывания в стационаре</Comment>
			<BasedOn>
				<xr:Item>Document.ОбращениеВСтационар</xr:Item>
				<xr:Item>Document.БронированиеКойкоМеста</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияПребывания</xr:Item>
				<xr:Item>InformationRegister.омг_ТекущиеМедицинскиеКарты</xr:Item>
				<xr:Item>InformationRegister.СостояниеКойкоМеста</xr:Item>
				<xr:Item>InformationRegister.КлиентыСтационара</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженияВСтационаре</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОбращения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбращениеВСтационар</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Полис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраховыеПолисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ЖурналЗаписиСтационар/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Перем ИдётОткрытиеОтчета;

&НаКлиенте
Перем ТекущаяСтрокаДереваОтбора;

&НаКлиенте
Перем мТребуетсяВыполнитьОтложенноеАвтообновлениеОтчета;

&НаКлиенте
Перем мДанныеДокументов;

&НаКлиенте
Перем мДанныеПриемовЗаявок;

&НаКлиенте
Перем мКлиентВзятИзДанныхДокумента;

&НаКлиенте
Перем мВыделенныйДиапазонЯчеекЖЗ;

&НаКлиенте
Перем мФормируетсяОтчет;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	
	ВысотаЗаголовка = мУчетнаяПолитика.ВысотаСтрокиЖурналаЗаписи;
	Если ВысотаЗаголовка = 0 Тогда
		ВысотаЗаголовка = 14;
	КонецЕсли;
	
	ДанныеХранилищаФормы = Новый Структура;
	мАдресХранилищаФормы = ПоместитьВоВременноеХранилище(ДанныеХранилищаФормы,ЭтаФорма.УникальныйИдентификатор);
	
	ПараметрыОтчета = ВосстановитьПараметрыОтчета();
	Если ПараметрыОтчета <> Неопределено Тогда
		Отчет.ДатаНачала		= ПараметрыОтчета.ДатаНачала;	
		ДлинаПериода			= ПараметрыОтчета.ДлинаПериода;
		Отчет.ДатаОкончания		= Отчет.ДатаНачала + (ДлинаПериода - 1) * 86400;
		Отчет.Филиал				= ПараметрыОтчета.Филиал;
		Отчет.Подразделение		= ПараметрыОтчета.Подразделение;
		Клиент					= ПараметрыОтчета.Клиент;
	Иначе
		Отчет.ДатаНачала = НачалоДня(ТекущаяДата());
		ДлинаПериода			= 6;
		Отчет.ДатаОкончания		= Отчет.ДатаНачала + (ДлинаПериода - 1) * 86400;
		Отчет.Филиал 			= УправлениеНастройками.ПолучитьФилиалПоУмолчаниюПользователя();
		Отчет.Подразделение		= Отчет.Филиал;
	КонецЕсли;
	Элементы.ПолеКалендаряВыборДаты.ВыделенныеДаты.Добавить(Отчет.ДатаНачала);
	Элементы.ПолеКалендаряВыборДаты.НачалоПериодаОтображения = НачалоДня(ТекущаяДата());
	
	Элементы.Филиал.Видимость = ПараметрыСеанса.УчетПоНесколькимФилиалам;
	
	СформироватьДеревоОтбора();
	Элементы.Филиал.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	
	ОбновитьКонтекстноеМенюЖурналаЗаписи();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Автоформирование отчета
	ИдётОткрытиеОтчета = Истина;
	ОбновитьОтчет();
	
	Если Истина//ИспользоватьПодключаемоеОборудование // Проверка на включенную ФО "Использовать ВО"
	   И МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда // Проверка на определенность рабочего места ВО
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		ПоддерживаемыеТипыВО.Добавить("СчитывательМагнитныхКарт");
		
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект);    
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	КонецЕсли;
	
	ПодключитьАвтообновлениеОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
		СохранитьПараметрыОтчета();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	// МеханизмВнешнегоОборудования
	ПоддерживаемыеТипыВО = Новый Массив();
	ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
	ПоддерживаемыеТипыВО.Добавить("СчитывательМагнитныхКарт");
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(Неопределено, УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	// Конец МеханизмВнешнегоОборудования
КонецПроцедуры

&НаКлиенте
Процедура ПолеКалендаряВыборДатыПриИзменении(Элемент)
	
	//Если Отчет.ДатаНачала < НачалоДня(ТекущаяДата()) Тогда 
	//	Предупреждение("Данные по прошлым периодам в журнале записи не отображаются");
	//	Отчет.ДатаНачала = НачалоДня(ТекущаяДата());
	//	Элементы.ПолеКалендаряВыборДаты.ВыделенныеДаты.Добавить(Отчет.ДатаНачала);
	//КонецЕсли;
	
	Элементы.ПолеКалендаряВыборДаты.Доступность = Ложь;
	ПриИзмененииНастроекФормирования();
	Элементы.ПолеКалендаряВыборДаты.Доступность = Истина;

КонецПроцедуры

&НаСервере
Процедура СохранитьПараметрыОтчета()
	
	// Сохранение текущего отбора и даты журнала записи
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ДатаНачала"			, Отчет.ДатаНачала);
	ПараметрыОтчета.Вставить("ДлинаПериода"			, ДлинаПериода);
	ПараметрыОтчета.Вставить("Подразделение"		, Отчет.Подразделение);
	ПараметрыОтчета.Вставить("Филиал"				, Отчет.Филиал);
	ПараметрыОтчета.Вставить("Клиент"				, Клиент);
	
	ПараметрыСеанса.ЖурналЗаписиСтационарТекущиеПараметры = ЗначениеВСтрокуВнутр(ПараметрыОтчета);
	
КонецПроцедуры

&НаСервере
Функция ВосстановитьПараметрыОтчета()
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.ЖурналЗаписиТекущиеПараметры) Тогда
		Попытка
			ПараметрыОтчета = ЗначениеИзСтрокиВнутр(ПараметрыСеанса.ЖурналЗаписиСтационарТекущиеПараметры);
		Исключение КонецПопытки;
		
		Если ТипЗнч(ПараметрыОтчета) = Тип("Структура") Тогда
			
			Возврат ПараметрыОтчета;	
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура СформироватьДеревоОтбора()
	
	ДеревоОтбора.ПолучитьЭлементы().Очистить();
	
	// 1. Корень
	СтрокаКорень = ДеревоОтбора.ПолучитьЭлементы().Добавить();
	Если ЗначениеЗаполнено(Отчет.Филиал) Тогда
		СтрокаКорень.Палата = Отчет.Филиал;
	Иначе
		СтрокаКорень.Палата = Справочники.Подразделения.ПустаяСсылка();
	КонецЕсли;
	
	// 2. Подразделения и палаты
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Палаты.Ссылка КАК Палата,
	|	Палаты.Подразделение КАК Подразделение,
	|	0 Как Порядок,
	|	Палаты.Наименование Как Наименование,
	|	Палаты.Подразделение.Наименование Как ПодразделениеНаименование
	|ИЗ
	|	Справочник.Палаты КАК Палаты
	|ГДЕ
	|	Не Палаты.ПометкаУдаления
	|	//%ОтборФилиал
    |
	//|ОБЪЕДИНИТЬ ВСЕ
	//|                                     
	//|ВЫБРАТЬ
	//|	Неопределено,
	//|	Подразделения.Ссылка,
	//|	1 Как Порядок,
	//|	"""",
	//|	Наименование
	//|ИЗ
	//|	Справочник.Подразделения КАК Подразделения
	//|ГДЕ  
	//|	Подразделения.ВсегдаПоказыватьВОтбореЖурналаЗаписи
	//|	//%ОтборСсылкаФилиал
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеНаименование,
	|	Порядок,
	|	Наименование
	|ИТОГИ ПО
	|	Подразделение"
	;
	Если ПараметрыСеанса.УчетПоНесколькимФилиалам
		И ЗначениеЗаполнено(Отчет.Филиал) 
	Тогда
		Запрос.УстановитьПараметр("Филиал",Отчет.Филиал);
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//%ОтборФилиал"," И (Палаты.Подразделение.Филиал = &Филиал
												 | Или Палаты.Подразделение.Филиал = Значение(Справочник.Филиалы.ПустаяСсылка))");
												 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//%ОтборСсылкаФилиал"," И (Филиал = &Филиал 
												 | Или Филиал = Значение(Справочник.Филиалы.ПустаяСсылка))");
	КонецЕсли;
	
	ВыбПодразделения = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыбПодразделения.Следующий() Цикл
		
		ВыбПалаты = ВыбПодразделения.Выбрать();
		
		Если ВыбПалаты.Количество() <> 0 Тогда
			СтрокаПодразделения = СтрокаКорень.ПолучитьЭлементы().Добавить();
			СтрокаПодразделения.Палата = ВыбПодразделения.Подразделение;
			
			Пока ВыбПалаты.Следующий() Цикл
				СтрокаПалата = СтрокаПодразделения.ПолучитьЭлементы().Добавить();
				СтрокаПалата.Палата = ВыбПалаты.Палата;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКонтекстноеМенюЖурналаЗаписи()
	
	КомандыКонтекстногоМенюЖурнала	= ЭтаФорма.КомандыКонтекстногоМенюЖурнала;
	Если КомандыКонтекстногоМенюЖурнала.Количество() = 0 Тогда
		// Первый вызов процедуры
		КомандыКонтекстногоМенюЖурнала	= Новый СписокЗначений;
		Для Каждого КнопкаМеню Из Элементы.ДокументРезультат.КонтекстноеМеню.ПодчиненныеЭлементы Цикл
			Если ТипЗнч(КнопкаМеню) = Тип("КнопкаФормы") Тогда
				КомандыКонтекстногоМенюЖурнала.Добавить(КнопкаМеню.ИмяКоманды, Команды.Найти(КнопкаМеню.ИмяКоманды).Заголовок,,КнопкаМеню.Картинка);
			КонецЕсли;
			КнопкаМеню.Видимость = Ложь;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте                                                   
Процедура ПодключитьАвтообновлениеОтчета()
	
	Если мУчетнаяПолитика.ПериодАвтообновленияЖурналаЗаписи <> 0 Тогда
		
		ПодключитьОбработчикОжидания("ВыполнитьАвтообновлениеОтчета", мУчетнаяПолитика.ПериодАвтообновленияЖурналаЗаписи, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьАвтообновлениеОтчета()
	
	ОтключитьОбработчикОжидания("ВыполнитьАвтообновлениеОтчета");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвтообновлениеОтчета()
	
	Если ЭтаФорма.ВводДоступен() Тогда
		ОбновитьОтчет(Ложь);
	Иначе
		ПодключитьОбработчикОжидания("ПроверкаНеобходимостиВыполненияОтложенногоАвтообновленияОтчета", 1, Ложь);
		ОтключитьАвтообновлениеОтчета()
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаНеобходимостиВыполненияОтложенногоАвтообновленияОтчета()
	
	Если ЭтаФорма.ВводДоступен() Тогда
		ОтключитьОбработчикОжидания("ПроверкаНеобходимостиВыполненияОтложенногоАвтообновленияОтчета");
		ОбновитьОтчет();
	КонецЕсли;
	
КонецПроцедуры

// Обновляет таблицу отчета
//
// Параметры:
//	Нет.
//
&НаКлиенте
Процедура ОбновитьОтчет(УстановитьФокусВводаНаТаблице = Истина) Экспорт
	
	ОтключитьАвтообновлениеОтчета();
	ОтключитьОбработчикОжидания("ПроверкаНеобходимостиВыполненияОтложенногоАвтообновленияОтчета");
	
	ПараметрыФормирования = Новый Структура;
	ПараметрыФормирования.Вставить("ВысотаСтроки",		Отчет.ВысотаСтроки);
	ПараметрыФормирования.Вставить("ДатаНачала",		Отчет.ДатаНачала);
	ПараметрыФормирования.Вставить("ДатаОкончания",		Отчет.ДатаОкончания);
	ПараметрыФормирования.Вставить("Подразделение",		Отчет.Подразделение);
	ПараметрыФормирования.Вставить("Филиал",				Отчет.Филиал);
	
	РезультатФормирования = СформироватьОтчет(ПараметрыФормирования);
	ДокументРезультат = РезультатФормирования.ДокументРезультат;
	мДанныеДокументов = РезультатФормирования.ДанныеДокументов;
	
	ПодключитьАвтообновлениеОтчета();
	
КонецПроцедуры // ОбновитьОтчет()

&НаСервереБезКонтекста
Функция СформироватьОтчет(ПараметрыФормирования)

	ОтчетОбъект = Обработки.ЖурналЗаписиСтационар.Создать();
	ЗаполнитьЗначенияСвойств(ОтчетОбъект, ПараметрыФормирования);
	
	РезультатФормирования = ОтчетОбъект.СформироватьОтчет();
		
	Возврат РезультатФормирования;	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПоместитьВХранилищеФормы(Адрес, Ключ, Значение)
	ДанныеХранилищаФормы = ПолучитьИзВременногоХранилища(Адрес);
	ДанныеХранилищаФормы.Вставить(Ключ, Значение);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИзХранилищаФормы(Адрес, Ключ)
	
	Перем Значение;
	
	ДанныеХранилищаФормы = ПолучитьИзВременногоХранилища(Адрес);
	Попытка
		Значение = ДанныеХранилищаФормы[Ключ];
	Исключение
	КонецПопытки;
	
	Возврат Значение;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииНастроекФормирования()
	Отчет.ДатаОкончания = Отчет.ДатаНачала + (ДлинаПериода - 1) * 86400;
	ОбновитьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ДлинаПериодаПриИзменении(Элемент)
	ПриИзмененииНастроекФормирования();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтбораПриАктивизацииСтроки(Элемент)
	
	Если ТекущаяСтрокаДереваОтбора = Элемент.ТекущаяСтрока Тогда
		Возврат
	Иначе
		ТекущаяСтрокаДереваОтбора = Элемент.ТекущаяСтрока;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Отчет.Подразделение = Элемент.ТекущиеДанные.Палата;
	КонецЕсли;
	
	Если ИдётОткрытиеОтчета Тогда
		ИдётОткрытиеОтчета = Ложь
	Иначе
		ОбновитьОтчет();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	
	СформироватьДеревоОтбора();
	Элементы.ДеревоОтбора.Обновить();
	
	Если ДеревоОтбора.ПолучитьЭлементы().Количество() <> 0 Тогда
		Элементы.ДеревоОтбора.Развернуть(ДеревоОтбора.ПолучитьЭлементы()[0].ПолучитьИдентификатор(), Истина);
	КонецЕсли;
	Подразделение = ДеревоОтбора.ПолучитьЭлементы()[0].Палата;
	ОбновитьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументРезультатПриАктивизацииОбласти(Элемент)
	
	Попытка
		Расшифровка = Элементы.ДокументРезультат.ТекущаяОбласть.Расшифровка;
	Исключение
		Возврат;
	КонецПопытки;
	
	Если ТипЗнч(Расшифровка) = Тип("ДокументСсылка.БронированиеКойкоМеста") Или 
		ТипЗнч(Расшифровка) = Тип("ДокументСсылка.УстановкаУсловийПребывания") Тогда
		КлиентДокумента = мДанныеДокументов.Получить(Расшифровка);
		Если ЗначениеЗаполнено(КлиентДокумента) Тогда
			Клиент = КлиентДокумента;
		КонецЕсли;
		мКлиентВзятИзДанныхДокумента = Истина;
	ИначеЕсли мКлиентВзятИзДанныхДокумента = Истина Тогда
		Клиент = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументРезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	ПодключитьОбработчикОжидания("ОткрытьКонтекстноеМеню",0.1,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДокументРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка)= Тип("Структура") Тогда
		СтандартнаяОбработка=Ложь;
		ДобавитьБронированиеПоЯчейкеЗаписи(Расшифровка);
		ОбновитьОтчет();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОбъектТекущейКолонки()
	
	Перем Объект;
	
	Для сч = 1 по 3 Цикл
		Область = ДокументРезультат.Область(сч, Элементы.ДокументРезультат.ТекущаяОбласть.Лево);
		Если ТипЗнч(Область.Расшифровка) = Тип("СправочникСсылка.Сотрудники") 
			Или ТипЗнч(Область.Расшифровка) = Тип("СправочникСсылка.Оборудование") 
		Тогда
			Объект = Область.Расшифровка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Объект;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПараметровПустойЯчейки(Расшифровка, Объект)
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтруктураПараметров = Новый Структура("ДатаНачала,Палата,КойкоМесто",Расшифровка.ДатаНачала,Расшифровка.Палата,Расшифровка.КойкоМесто);
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьБронированиеПоЯчейкеЗаписи(РасшифровкаОбластиЯчеек)
	
	ЗначенияЗаполнения = ПолучитьСтруктуруПараметровПустойЯчейки(РасшифровкаОбластиЯчеек, ПолучитьОбъектТекущейКолонки());
	ЗначенияЗаполнения.Вставить("Дата", ТекущаяДата());
	ЗначенияЗаполнения.Вставить("ДатаНачала", ЗначенияЗаполнения.ДатаНачала);
	ЗначенияЗаполнения.Вставить("Клиент", Клиент);
	ЗначенияЗаполнения.Вставить("Палата",    ЗначенияЗаполнения.Палата);
	ЗначенияЗаполнения.Вставить("КойкоМесто",ЗначенияЗаполнения.КойкоМесто);
	
	Если ЗначениеЗаполнено(Отчет.Филиал) Тогда
		ЗначенияЗаполнения.Вставить("Филиал", Отчет.Филиал);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",ЗначенияЗаполнения);
	
	ПолучитьФорму("Документ.БронированиеКойкоМеста.ФормаОбъекта", ПараметрыФормы).Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонтекстноеМеню()
	
	СписокКоманд = ПолучитьСписокМенюЖурналаЗаписи(Элементы.ДокументРезультат.ТекущаяОбласть.Расшифровка);
	элКоманда = ВыбратьИзМеню(СписокКоманд, Элементы.ДокументРезультат);
	Если элКоманда <> Неопределено Тогда
		Команда = Команды.Найти(элКоманда.Значение);
		Выполнить(Команда.Действие+"(Команда)");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокМенюЖурналаЗаписи(Расшифровка)

	СписокКнопокМеню = Новый СписокЗначений;
	
	КомандыКонтекстногоМенюЖурнала	= ЭтаФорма.КомандыКонтекстногоМенюЖурнала;
	
	ЭтоБронь			= ТипЗнч(Расшифровка) = Тип("ДокументСсылка.БронированиеКойкоМеста");
	ЭтоУсловия			= ТипЗнч(Расшифровка) = Тип("ДокументСсылка.УстановкаУсловийПребывания");	
	ЭтоСвободноеВремя	= ТипЗнч(Расшифровка) = Тип("Структура");
	
	Если ЭтоБронь Или ЭтоУсловия Тогда
		
		// Открыть клиента
		ДобавитьЭлементСпискаЗначенийКопированием(СписокКнопокМеню, КомандыКонтекстногоМенюЖурнала.НайтиПоЗначению("КонтекстноеМенюОткрытьКлиента"));
		
		
		// Группа бронь
		Если ЭтоБронь Тогда
			// Создания
			ДобавитьЭлементСпискаЗначенийКопированием(СписокКнопокМеню, КомандыКонтекстногоМенюЖурнала.НайтиПоЗначению("КонтекстноеМенюСоздатьПоступление"));
			ДобавитьЭлементСпискаЗначенийКопированием(СписокКнопокМеню, КомандыКонтекстногоМенюЖурнала.НайтиПоЗначению("КонтекстноеМенюОткрытьБронь"));
			ДобавитьЭлементСпискаЗначенийКопированием(СписокКнопокМеню, КомандыКонтекстногоМенюЖурнала.НайтиПоЗначению("КонтекстноеМенюУдалитьБронь"));
			ДобавитьЭлементСпискаЗначенийКопированием(СписокКнопокМеню, КомандыКонтекстногоМенюЖурнала.НайтиПоЗначению("КонтекстноеМенюСоздатьОбращение"));
		ИначеЕсли ЭтоУсловия Тогда
			ДобавитьЭлементСпискаЗначенийКопированием(СписокКнопокМеню, КомандыКонтекстногоМенюЖурнала.НайтиПоЗначению("КонтекстноеМенюСоздатьИзменениеУсловий"));
			ДобавитьЭлементСпискаЗначенийКопированием(СписокКнопокМеню, КомандыКонтекстногоМенюЖурнала.НайтиПоЗначению("КонтекстноеМенюСоздатьВыписку"));
			ДобавитьЭлементСпискаЗначенийКопированием(СписокКнопокМеню, КомандыКонтекстногоМенюЖурнала.НайтиПоЗначению("КонтекстноеМенюОткрытьУстановкуУсловий"));
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоСвободноеВремя Тогда
		ДобавитьЭлементСпискаЗначенийКопированием(СписокКнопокМеню, КомандыКонтекстногоМенюЖурнала.НайтиПоЗначению("КонтекстноеМенюСоздатьБронь"));
	КонецЕсли; 

	Возврат СписокКнопокМеню;
	
КонецФункции

&НаКлиенте
Процедура КонтекстноеМенюУдалитьБронь(Команда)
	
	Расшифровка = ДокументРезультат.ТекущаяОбласть.Расшифровка;
	Если ТипЗнч(Расшифровка) = Тип("ДокументСсылка.БронированиеКойкоМеста") Тогда
		Ответ = Вопрос("Вы уверены, что хотите отменить бронь?",РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ОтменитьБронь(Расшифровка);
			ОбновитьОтчет();
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтменитьБронь(БронированиеДокумент) 
	Если ЗначениеЗаполнено(БронированиеДокумент) Тогда
		БроньОбъект = БронированиеДокумент.ПолучитьОбъект();
		БроньОбъект.УстановитьПометкуУдаления(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтекстноеМенюОткрытьКлиента(Команда)
	
	Расшифровка = ДокументРезультат.ТекущаяОбласть.Расшифровка;
	Если ТипЗнч(Расшифровка)= Тип("ДокументСсылка.БронированиеКойкоМеста") Или ТипЗнч(Расшифровка) = Тип("ДокументСсылка.УстановкаУсловийПребывания") Тогда
		ОткрытьЗначение(ПолучитьЗначениеРеквизитаСсылки(Расшифровка,"Клиент"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстноеМенюСоздатьБронь(Команда)
	
	Расшифровка = ДокументРезультат.ТекущаяОбласть.Расшифровка;
	ДобавитьБронированиеПоЯчейкеЗаписи(Расшифровка);
	ОбновитьОтчет();
			
КонецПроцедуры

&НаКлиенте
Процедура КонтекстноеМенюСоздатьПоступление(Команда)
	
	Расшифровка = ДокументРезультат.ТекущаяОбласть.Расшифровка;
	Если ТипЗнч(Расшифровка) <> Тип("Структура") Тогда 
		ЗначенияЗаполнения = Новый Структура("ДокументОснование,ВидОперации",Расшифровка,ПредопределенноеЗначение("Перечисление.ВидыДвиженияВСтационаре.Поступление"));
	
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",ЗначенияЗаполнения);
		
		ОткрытьФорму("Документ.УстановкаУсловийПребывания.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстноеМенюСоздатьИзменениеУсловий(Команда)
	
	Расшифровка = ДокументРезультат.ТекущаяОбласть.Расшифровка;
	Если ТипЗнч(Расшифровка) <> Тип("Структура") Тогда 
		ЗначенияЗаполнения = Новый Структура("ДокументОснование,ВидОперации,Клиент",Расшифровка,ПредопределенноеЗначение("Перечисление.ВидыДвиженияВСтационаре.ИзменениеУсловий"),ОбщегоНазначения.ПолучитьЗначениеРеквизита(Расшифровка,"Клиент"));

	
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",ЗначенияЗаполнения);
		
		ОткрытьФорму("Документ.УстановкаУсловийПребывания.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстноеМенюСоздатьВыписку(Команда)
	
	Расшифровка = ДокументРезультат.ТекущаяОбласть.Расшифровка;
	Если ТипЗнч(Расшифровка) <> Тип("Структура") Тогда 
		ЗначенияЗаполнения = Новый Структура("ДокументОснование,ВидОперации,Клиент",Расшифровка,ПредопределенноеЗначение("Перечисление.ВидыДвиженияВСтационаре.Выписка"),ОбщегоНазначения.ПолучитьЗначениеРеквизита(Расшифровка,"Клиент"));
	
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",ЗначенияЗаполнения);
		
		ОткрытьФорму("Документ.УстановкаУсловийПребывания.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстноеМенюСоздатьОбращение(Команда)
	
	Расшифровка = ДокументРезультат.ТекущаяОбласть.Расшифровка;
	Если ТипЗнч(Расшифровка) <> Тип("Структура") Тогда 
		ЗначенияЗаполнения = Новый Структура("ДокументОснование",Расшифровка);
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",ЗначенияЗаполнения);
	
		ОткрытьФорму("Документ.ОбращениеВСтационар.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстноеМенюОткрытьБронь(Команда)
	
	Расшифровка = ДокументРезультат.ТекущаяОбласть.Расшифровка;
	Если ТипЗнч(Расшифровка) = Тип("ДокументСсылка.БронированиеКойкоМеста") Тогда
		ОткрытьЗначение(Расшифровка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонтекстноеМенюОткрытьУстановкуУсловий(Команда)
	
	Расшифровка = ДокументРезультат.ТекущаяОбласть.Расшифровка;
	Если ТипЗнч(Расшифровка) = Тип("ДокументСсылка.УстановкаУсловийПребывания") Тогда
		ОткрытьЗначение(Расшифровка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлементСпискаЗначенийКопированием(СписокПриемник, ЭлементИсточник)
	ЭлементПриемник = СписокПриемник.Добавить();
	ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизитаСсылки(Ссылка, ИмяРеквизита)
	
	Возврат Ссылка[ИмяРеквизита];
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеДокументаВЖурналеЗаписи" Или ИмяСобытия = "УстановкаУсловийПребывания" Тогда 
		ОбновитьОтчет();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:
				|""%ОписаниеОшибки%"".'" );
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры
